aerofoilNACA0012_compressible_rhoPimpleFoam_RAS/system/solverInfo

// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

fields      ( p U e k omega );


// ************************************************************************* //
